export interface WorkItem {
  title: string;
  role: string;
  venue?: string;
  description?: string;
}

export interface WorkYear {
  year: string;
  works: WorkItem[];
}

export const worksTimeline: WorkYear[] = [
  {
    year: "2025",
    works: [
      {
        title: "Петровы в гриппе и вокруг него",
        role: "Композитор, саунд-дизайнер",
        venue: "Саратовский театр драмы",
      },
      {
        title: "Homo Homini",
        role: "Композитор, саунд-дизайнер, звукорежиссёр",
        venue: "короткометражный фильм",
      },
      {
        title: "Вечный город",
        role: "Композитор, аудио-программист",
        venue: "Panasonic Neo Silk Way",
      },
    ],
  },
  {
    year: "2024",
    works: [
      {
        title: "Идиот",
        role: "Композитор, саунд-дизайнер, FOH-инженер",
        venue: "Саратовский театр драмы",
      },
      {
        title: "Маяковский. Я сам",
        role: "Композитор, саунд-дизайнер",
        venue: "Московский театр Эстрады",
      },
      {
        title: "Сон о Хлебе",
        role: "Композитор, звукорежиссёр",
        venue: "Зотов Центр",
      },
      {
        title: "Ред Стаг",
        role: "Автор песни",
        venue: 'саундтрек к т/с «Универ. 13 лет спустя»',
      },
    ],
  },
  {
    year: "2023",
    works: [
      {
        title: "Ма",
        role: "Саунд-дизайнер, звукорежиссёр",
        venue: "короткометражный фильм",
      },
      {
        title: "Porsche Show",
        role: "Композитор, саунд-дизайнер",
        venue: "Алматы, Казахстан",
      },
    ],
  },
  {
    year: "2019–2022",
    works: [
      {
        title: "Танцы на празднике Урожая",
        role: "Композитор, саунд-дизайнер",
        venue: "Саратовский театр драмы, 2022",
      },
      {
        title: "Погружение. Променад",
        role: "Композитор, саунд-дизайнер",
        venue: "аудиоспектакль в Telegram, 2021",
      },
      {
        title: "Иллюзии",
        role: "Композитор, саунд-дизайнер",
        venue: 'театр «Современник», 2021',
      },
      {
        title: "Van Cleef and Arpels",
        role: "Аранжировщик, саунд-дизайнер",
        venue: "показ-дефиле, Москва, 2019",
      },
      {
        title: "Жизнь в искусстве",
        role: "Саунд-дизайнер",
        venue: "короткометражный фильм, 2019",
      },
      {
        title: "Иранская конференция",
        role: "Саунд-дизайнер",
        venue: "Театр Наций, 2019",
      },
    ],
  },
];
